# Задача 1. Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.
# *Пример:*
# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1

# Решение 1:

# my_list = ['qwe', 'asd', 'zxc', 'qwe', 'ertqwe']
# my_list = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
# my_list = ["йцу", "фыв", "ячс", "цук", "йцукен"]
# my_list = ["123", "234", 123, "567"]
# my_list = []
# print(my_list)
# count = -1
# index = 0
# search = input('Введите искомое число: ')
# for item in range(len(my_list)):
#     if search == my_list[item]:
#         count += 1
#         if count == 1:
#             index = item
#             break
# if count == 1:
#     print(f'Второе совпадение строки {search} со строкой под индексом {index}')
# else:
#     print('Второго совпадения нет')

# Решение 2:

my_list1 = ['qwe', 'asd', 'zxc', 'qwe', 'ertqwe']
my_list2 = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
my_list3 = ["йцу", "фыв", "ячс", "цук", "йцукен"]
my_list4 = ["123", "234", 123, "567"]

def check(my_list: list, search: str):
    count = 0
    for i in range(len(my_list)):
        if search == my_list[i]:
            count += 1
            if count == 2:
                print(f'Второй индекс вхождения - {i}')
                break
    else:
        print('Второго вхождения нет')

# print(my_list1.count('qwe'))
check(my_list1, 'qwe')
check(my_list2, 'йцу')
check(my_list3, 'йцу')
check(my_list4, '123')

# 3 решение:

# my_list1 = ['qwe', 'asd', 'zxc', 'qwe', 'ertqwe']
# my_list2 = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
# my_list3 = ["йцу", "фыв", "ячс", "цук", "йцукен"]
# my_list4 = ["123", "234", 123, "567"]

# print(my_list1.index('qwe', 2))
# # print(my_list1.index('йцу', 2)) # Нужен обработчик, т.к. если нет второго значения, программа выдает ошибку
# # print(my_list1.index('йцу', 2)) # Нужен обработчик, т.к. если нет второго значения, программа выдает ошибку
# # print(my_list1.index('123', 2)) # Нужен обработчик, т.к. если нет второго значения, программа выдает ошибку
